const IssueData = [
    {
        'id': 1,
        'issueHeadline': 'टुकोनको राष्ट्रिय सम्मेलन असोजमा (Issue 1)',
        'issueDate': 'Jul 19, 2023',
        'issueDetail': 'काठमाडौं । राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ । ६६ जिल्लामा संगठन फैलाएको महासंघले सो सम्मेलनमा प्रत्येक',
        'issueImage':'/IssueImage/issue1.jpeg'
    },
    {
        'id': 2,
        'issueHeadline': 'टुकोनको राष्ट्रिय सम्मेलन असोजमा (Issue 2)',
        'issueDate': 'Jul 19, 2023',
        'issueDetail': 'काठमाडौं । राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ । ६६ जिल्लामा संगठन फैलाएको महासंघले सो सम्मेलनमा प्रत्येक',
        'issueImage':'/IssueImage/issue2.jpeg'
    },
    {
        'id': 3,
        'issueHeadline': 'टुकोनको राष्ट्रिय सम्मेलन असोजमा (Issue 3)',
        'issueDate': 'Jul 19, 2023',
        'issueDetail': 'काठमाडौं । राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ । ६६ जिल्लामा संगठन फैलाएको महासंघले सो सम्मेलनमा प्रत्येक',
        'issueImage':'/IssueImage/issue3.jpeg'
    },
]
export default IssueData