const NewsData = [
    {
        'id': 1,
        'newsHeadline': 'टुकोनको राष्ट्रिय सम्मेलन असोजमा',
        'newsPublishedDate': 'Jul 19, 2023',
        'newsDetail': 'काठमाडौं । राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ । ६६ जिल्लामा संगठन फैलाएको महासंघले सो सम्मेलनमा प्रत्येक राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ । ६६ जिल्लामा संगठन फैलाएको महासंघले सो सम्मेलनमा प्रत्येक राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ । ६६ जिल्लामा संगठन फैलाएको महासंघले सो सम्मेलनमा प्रत्येक',
        'newsImage':'/newsImage/news1.jpeg'
    },
    {
        'id': 2,
        'newsHeadline': 'टुकोनको राष्ट्रिय सम्मेलन असोजमा',
        'newsPublishedDate': 'Jul 02, 2023',
        'newsDetail': 'काठमाडौं । राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ ',
        'newsImage':'/newsImage/news1.jpeg'
    },
    {
        'id': 3,
        'newsHeadline': 'Headline3',
        'newsPublishedDate': 'Jul 23, 2023',
        'newsDetail': 'काठमाडौं । राष्ट्रिय प्रजातन्त्र पार्टी नेपाल निकट ट्रेड यूनियन महासंघ नेपाल (टुकोन) को आज सम्पन्न केन्द्रीय पदाधिकारीहरूको बैठकले आगामी असोजको ५ गते श्रमिकहरुको वृहद राष्ट्रिय सम्मेलन काठमाडौंमा गर्ने निर्णय गरेको छ ',
        'newsImage':'/newsImage/news1.jpeg'
    }
]
export default NewsData