import NewsData from "../../Data/NewsData";
import Button from "../../Components/Button";

const ChairmanMessage = () => {
  return (
    <>
      <div className="bg-blue-700">
        <div className="container mx-auto">
          <div className="py-8 flex justify-center">
            <div>
              <h1 className="text-5xl text-white tracking-wider">
                MESSAGE FROM CHAIRMAN
              </h1>
            </div>
          </div>
        </div>
      </div>
      <div className="container mx-auto">
        <div className="flex py-10 gap-4">
          {/* --------- Issue Section --------- */}
          <div className="w-3/4 flex p-8 border shadow-xl bg-offWhite">
          <p className="text-lg">१९९७ साल देखि विभिन्न कालखण्डमा नेपाली जनताले संचालन गरेका राणा
              विरोधी आन्दोलन, निरंकुश पञ्चायत विरोधी आन्दोलन, राजतन्त्रको अन्त्य
              तथा राष्ट्रिय स्वाधीनताको पक्षमा भएका शान्तिपूर्ण जनक्रान्ति,
              जनयुद्ध, मधेश जनविद्रोह, आदीवासी जनजाति, खस, आर्य थारु, महिला,
              मुस्लिम लगायत उत्पीडित वर्ग समुदायले चलाएको आन्दोलन र बलिदानीपुर्ण
              संघर्षमा नेपाली श्रमिक वर्गले सक्रिय सहभागिता रहँदै आएको तर
              जुनसुकै राजनितिक परिवर्तनको आन्दोलनमा श्रमिकहरुलाई सडकमा उतार्ने र
              आन्दोलन सफल भएपछि श्रमिकका आधारभुत समस्याहरु हल गर्न कुनै पनि
              राजनैतिक पार्टीहरुले उचित भुमिका खेलेको पाईएन । तसर्थ; देशभक्ति,
              स्वतन्त्रता, स्वाभिमान, अग्रगामी, संघर्षशील र श्रमशील नेपाली
              श्रमिकको आधारभुत वर्ग चरित्र हुन भन्ने तथ्यलाई दृष्टिगत गर्दै महान
              सर्वहारा श्रमिकको न्याय समानता स्वतन्त्रता पहिचान सुशासन समृद्धिको
              आकाङक्षा पुरा गर्न नेपाली श्रमिकले नेपाली श्रमिककै लागि एउटा पृथक
              वैकल्पिक विचार उद्देश्य बोकेको ट्रेड युनियन महासंघ निमार्ण गर्न
              देश भरिका विभिन्न क्षेत्रमा शारीरिक मानसिक रुपमा कृयाशील रहेर
              आफ्नो जीवन यापनको लागि श्रम गर्ने श्रमजीवी वर्गको सर्वोत्तम हित र
              समृद्धि नै ट्रेड यूनियन महासंघको लक्ष्य हो भन्ने मान्यतालाई
              आत्मसात गरि संगठित वा असंगठित क्षेत्रमा रहेका लाखौं श्रमिकहरुलाई
              महासंघमा आवद्ध गर्दै दलाल आसेपासे पुँजीवादका विरुद्ध नेपाली
              श्रमजीवी वर्गको आर्थिक तथा सामाजिक रुपान्तरणका लागि राष्ट्रिय
              पुँजीको विकास गर्दै गाँस बाँस कपास साथै शिक्षा स्वास्थ्य, रोजगारी
              जस्ता श्रमिकको आधारभुत आवश्यकताहरुको सुनिश्चितताका साथै श्रमजीवी
              वर्ग माथि गर्ने सबै खाले शोषणको अन्त्य गरि शोषण विहिन समाज
              निमार्णको उद्देश्यले समावेशी लोकतान्त्रिक ट्रेड युनियन महासंघ
              नेपाल २०६६ बैशाख ३० गते विधिवत तवरले श्रम विभागमा दर्ता भइ दर्ता
              नं. १० कायम भएको हो । यस समय देखि निरन्तर रुपमा श्रम वर्गका पेशागत
              हकहित र उत्थानका लागि कार्यरत भएको र २०७० मा ILO को GEVENAR BODY
              मा भाग लिएको २०७१।०३।२५ गते ‘ <span className="font-semibold">समावेशी लोकतान्त्रिक ट्रेड युनियन
              महासंघ नेपाल</span>  र राष्ट्रिय प्रजातान्त्रिक ट्रेड युनियन महासंघ,
              स्वतन्त्र’’ सँग एकीकरण गरी दर्ता नं. १० नै कायम गरि नयाँ नाम
              राष्ट्रिय लोकतान्त्रिक ट्रेड युनियन महासंघ, स्वतन्त्र भई निरन्तर
              ILO, सरकार, JTUCC र अन्य संघ, संस्थासँग सहयात्रा गर्दै अगाडी
              निरन्तर बढिरहेको हुँदा २०७०।११।०६ गते ‘‘राष्ट्रिय लोकतान्त्रिक
              ट्रेड यूनियन महासंघ–स्वतन्त्र’’ को विषेश महाधिवेशनले प्रथम विधान
              संशोधन गरी नाम परिवर्तन भई ‘‘समाजवादी ट्रेड युनियन महासंघ, नेपाल’’
              रहेको छ । र ‘समाजवादी ट्रेड यूनियन महासंघ, नेपाल नामको महासंघको
              विधान जारि गरिएको छ । अहिले समाजवादी ट्रेड युनियन महासंघ, नेपाल
              सँग आवद्ध राष्ट्रिय संगठन र संघहरु निम्म प्रकारका रहेका छन् ।</p>
          </div>

          {/* --------- News Section --------- */}
          <div className="w-1/4 h-[520px] flex flex-col border shadow-xl bg-offWhite">
            <div>
              <h3 className="text-2xl font-light border-b bg-darkblue text-white px-4 py-2">
                News / Events
              </h3>
            </div>
            {NewsData.slice(0,2).map((item) => (
              <div className="flex gap-4 p-2" key={item.id}>
                {/* <div className="relative w-1/2 h-60">
                  <img
                    src={item.newsImage}
                    alt=""
                    className="absolute w-full h-full object-cover"
                  />
                </div> */}
                <div className="flex flex-col p-4">
                  <h1 className="text-lg">{item.newsHeadline}</h1>
                  <p className="text-sm">{item.newsPublishedDate}</p>
                  <p className="text-sm text-slate-700">{item.newsDetail}</p>
                  <Button />
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>
    </>
  );
};

export default ChairmanMessage;
